In [1]:
import pandas as pd
import numpy as np

In [2]:
coor = pd.DataFrame([['Amsterdam', 52.22, 4.54],
                     ['Athens', 37.5902, 23.43401],
                     ['Barcelona', 41.23, 2.11],
                     ['Berlin', 52.3112, 13.2418],
                     ['Brussels', 50.51, 4.21],
                     ['Copenhagen', 55.4034, 12.3406],
                     ['Dublin', 53.21, -6.16],
                     ['Geneva', 46.12, 6.09],
                     ['Lisbon', 38.4331, -9.09],
                     ['London', 51.3026, -0.739],
                     ['Lyon', 45.46, 4.5],
                     ['Madrid', 40.25, -3.43],
                     ['Milan', 45.2801, 9.1124],
                     ['Munich', 48.08, 11.34],
                     ['Oslo', 59.545, 10.458],
                     ['Paris', 48.5124, 2.2108],
                     ['Prague', 50.05, 14.25],
                     ['Rome', 41.53, 12.3],
                     ['Stockholm', 59.1946, 18.47],
                     ['Venice', 45.2615, 12.209],
                     ['Vienna', 48.12, 16.22]
                    ],
                    columns=['city', 'latitude', 'longitude']
                   )
coor.set_index('city', inplace=True)
coor.head(3)

           latitude  longitude
city
Amsterdam   52.2200    4.54000
Athens      37.5902   23.43401
Barcelona   41.2300    2.11000

In [3]:
def review_count_eu(city):
    file = 'lang_reviews_' + city + '.csv.gz'
    cdf = pd.read_csv(file, encoding='utf-8', low_memory=False)
    cdf = cdf.drop(columns=['listing_id', 'id', 'reviewer_id', 'lang'])
    cdf = cdf.dropna()
    cdf['date'] = pd.to_datetime(cdf['date'])
    cdf['week_date'] = (cdf['date'].dt.year.astype(str)
                        + '-W'
                        + cdf['date'].dt.week.astype(str)
                       )
    cdf = cdf.drop(columns=['date'])
    cdf['review_count'] = 1
    cdf = cdf.groupby('week_date').count()
    cdf = cdf.reset_index()
    cdf['city'] = city
    cdf['latitude'] = coor.latitude[city]
    cdf['longitude'] = coor.longitude[city]
    return cdf

In [4]:
clist = coor.index

c21_c = pd.DataFrame([])

for city in clist:
    c1 = review_count_eu(city)
    c21_c = pd.concat([c21_c, c1])

In [5]:
c21_c.head(3)

  week_date  review_count       city  latitude  longitude
0  2009-W14             1  Amsterdam     52.22       4.54
1  2009-W17             1  Amsterdam     52.22       4.54
2  2009-W18             1  Amsterdam     52.22       4.54

In [6]:
c21_c.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10725 entries, 0 to 504
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   week_date     10725 non-null  object
 1   review_count  10725 non-null  int64
 2   city          10725 non-null  object
 3   latitude      10725 non-null  float64
 4   longitude     10725 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 502.7+ KB

In [7]:
c21_c.to_csv('cities21_review_count(by_week).csv.gz',
             index=False, encoding='utf-8', compression='gzip')

In [8]:
from2019 = c21_c['week_date'] > '2019-W01'
c21_c_from2019 = c21_c.loc[from2019]
c21_c_from2019.head(3)

    week_date  review_count       city  latitude  longitude
456   2019-W1          3504  Amsterdam     52.22       4.54
457  2019-W10          1783  Amsterdam     52.22       4.54
458  2019-W11          1869  Amsterdam     52.22       4.54

In [9]:
c21_c_from2019.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1995 entries, 456 to 504
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   week_date     1995 non-null   object
 1   review_count  1995 non-null   int64
 2   city          1995 non-null   object
 3   latitude      1995 non-null   float64
 4   longitude     1995 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 93.5+ KB

In [10]:
c21_c_from2019.to_csv('cities21_review_count(by_week)_from2019.csv.gz',
                      index=False, encoding='utf-8', compression='gzip')